Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/silex.h
/*
 * Component description for SILEX
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-06-23T14:51:53Z */
#ifndef _WBZ35_SILEX_COMPONENT_H_
#define _WBZ35_SILEX_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SILEX                                        */
/* ************************************************************************** */

/* -------- SILEX_DMA_FETCH_ADDR_LSB : (SILEX Offset: 0x00) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_ADDR_LSB_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_ADDR_LSB)   Reset Value */

#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_FETCH_ADDR_LSB)  Position */
#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos) /* (SILEX_DMA_FETCH_ADDR_LSB)  Mask */
#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB(value) (SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos)) /* Assigment of value for FETCH_ADDR_LSB in the SILEX_DMA_FETCH_ADDR_LSB register */
#define SILEX_DMA_FETCH_ADDR_LSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_ADDR_LSB) Register Mask  */


/* -------- SILEX_DMA_FETCH_ADDR_MSB : (SILEX Offset: 0x04) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_ADDR_MSB_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_ADDR_MSB)   Reset Value */

#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_FETCH_ADDR_MSB)  Position */
#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos) /* (SILEX_DMA_FETCH_ADDR_MSB)  Mask */
#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB(value) (SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos)) /* Assigment of value for FETCH_ADDR_MSB in the SILEX_DMA_FETCH_ADDR_MSB register */
#define SILEX_DMA_FETCH_ADDR_MSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_ADDR_MSB) Register Mask  */


/* -------- SILEX_DMA_FETCH_LEN : (SILEX Offset: 0x08) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_LEN_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_LEN)   Reset Value */

#define SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos     _UINT32_(0)                                          /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_LEN_Msk     (_UINT32_(0xFFFFFFF) << SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_LEN(value)  (SILEX_DMA_FETCH_LEN_FETCH_LEN_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos)) /* Assigment of value for FETCH_LEN in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos _UINT32_(28)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR(value) (SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos)) /* Assigment of value for FETCH_CSTADDR in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos _UINT32_(29)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN(value) (SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos)) /* Assigment of value for FETCH_REALIGN in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos _UINT32_(30)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING(value) (SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos)) /* Assigment of value for FETCH_ZPADDING in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_Msk               _UINT32_(0x7FFFFFFF)                                 /* (SILEX_DMA_FETCH_LEN) Register Mask  */


/* -------- SILEX_DMA_FETCH_TAG : (SILEX Offset: 0x0C) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_TAG_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_TAG)   Reset Value */

#define SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos     _UINT32_(0)                                          /* (SILEX_DMA_FETCH_TAG)  Position */
#define SILEX_DMA_FETCH_TAG_FETCH_TAG_Msk     (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos) /* (SILEX_DMA_FETCH_TAG)  Mask */
#define SILEX_DMA_FETCH_TAG_FETCH_TAG(value)  (SILEX_DMA_FETCH_TAG_FETCH_TAG_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos)) /* Assigment of value for FETCH_TAG in the SILEX_DMA_FETCH_TAG register */
#define SILEX_DMA_FETCH_TAG_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_TAG) Register Mask  */


/* -------- SILEX_DMA_PUSH_ADDR_LSB : (SILEX Offset: 0x10) (R/W 32)  -------- */
#define SILEX_DMA_PUSH_ADDR_LSB_RESETVALUE    _UINT32_(0x00)                                       /*  (SILEX_DMA_PUSH_ADDR_LSB)   Reset Value */

