Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/silex.h
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Position */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Msk (_UINT32_(0xFFFF) << SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos) /* (SILEX_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Mask */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2(value) (SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Msk & (_UINT32_(value) << SILEX_HWCONF_BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_Pos)) /* Assigment of value for BA411E_AES_HW_CFG_2 in the SILEX_HWCONF_BA411E_AES_HW_CFG_2 register */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_Msk  _UINT32_(0x0000FFFF)                                 /* (SILEX_HWCONF_BA411E_AES_HW_CFG_2) Register Mask  */


/* -------- SILEX_HWCONF_BA413_HASH_HW_CFG : (SILEX Offset: 0x40C) ( R/ 32)  -------- */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA413_HASH_HW_CFG)   Reset Value */

#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Position */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk (_UINT32_(0x7F) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos) /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Mask */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK(value) (SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk & (_UINT32_(value) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos)) /* Assigment of value for BA413_HASH_HW_CFG_MASK in the SILEX_HWCONF_BA413_HASH_HW_CFG register */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos _UINT32_(16)                                         /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Position */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos) /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Mask */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING(value) (SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Msk & (_UINT32_(value) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PASSING_Pos)) /* Assigment of value for BA413_HASH_HW_CFG_PASSING in the SILEX_HWCONF_BA413_HASH_HW_CFG register */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos _UINT32_(17)                                         /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Position */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos) /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Mask */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC(value) (SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk & (_UINT32_(value) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos)) /* Assigment of value for BA413_HASH_HW_CFG_HMAC in the SILEX_HWCONF_BA413_HASH_HW_CFG register */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos _UINT32_(18)                                         /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Position */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos) /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Mask */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST(value) (SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk & (_UINT32_(value) << SILEX_HWCONF_BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos)) /* Assigment of value for BA413_HASH_HW_CFG_VERIFYDIGEST in the SILEX_HWCONF_BA413_HASH_HW_CFG register */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_Msk    _UINT32_(0x0007007F)                                 /* (SILEX_HWCONF_BA413_HASH_HW_CFG) Register Mask  */


/* -------- SILEX_HWCONF_BA418_SHA3_HW_CFG : (SILEX Offset: 0x410) ( R/ 32) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. -------- */
#define SILEX_HWCONF_BA418_SHA3_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.  Reset Value */

#define SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Position */
#define SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos) /* (SILEX_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Mask */
#define SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG(value) (SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk & (_UINT32_(value) << SILEX_HWCONF_BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos)) /* Assigment of value for BA418_SHA3_HW_CFG in the SILEX_HWCONF_BA418_SHA3_HW_CFG register */
#define SILEX_HWCONF_BA418_SHA3_HW_CFG_Msk    _UINT32_(0x00000001)                                 /* (SILEX_HWCONF_BA418_SHA3_HW_CFG) Register Mask  */


/* -------- SILEX_HWCONF_BA419_SM4_HW_CFG : (SILEX Offset: 0x414) ( R/ 32) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. -------- */
#define SILEX_HWCONF_BA419_SM4_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.  Reset Value */

#define SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Position */
#define SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk (_UINT32_(0x7F) << SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos) /* (SILEX_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Mask */
#define SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG(value) (SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk & (_UINT32_(value) << SILEX_HWCONF_BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos)) /* Assigment of value for BA419_SM4_HW_CFG in the SILEX_HWCONF_BA419_SM4_HW_CFG register */
#define SILEX_HWCONF_BA419_SM4_HW_CFG_Msk     _UINT32_(0x0000007F)                                 /* (SILEX_HWCONF_BA419_SM4_HW_CFG) Register Mask  */


/* -------- SILEX_HWCONF_BA424_ARIA_HW_CFG : (SILEX Offset: 0x418) ( R/ 32) Generic g_aria_modePoss value. BA424-Aria engine configuration. -------- */
#define SILEX_HWCONF_BA424_ARIA_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration.  Reset Value */

#define SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Position */
#define SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk (_UINT32_(0x1FF) << SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos) /* (SILEX_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Mask */
#define SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG(value) (SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk & (_UINT32_(value) << SILEX_HWCONF_BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos)) /* Assigment of value for BA424_ARIA_HW_CFG in the SILEX_HWCONF_BA424_ARIA_HW_CFG register */
#define SILEX_HWCONF_BA424_ARIA_HW_CFG_Msk    _UINT32_(0x000001FF)                                 /* (SILEX_HWCONF_BA424_ARIA_HW_CFG) Register Mask  */


/* -------- SILEX_RNG_CONTROL_CONTROL : (SILEX Offset: 0x1000) (R/W 32) Control register -------- */
#define SILEX_RNG_CONTROL_CONTROL_RESETVALUE  _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_CONTROL) Control register  Reset Value */

#define SILEX_RNG_CONTROL_CONTROL_ENABLE_Pos  _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_CONTROL) Enable the NDRNG. Position */
#define SILEX_RNG_CONTROL_CONTROL_ENABLE_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_ENABLE_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Enable the NDRNG. Mask */
#define SILEX_RNG_CONTROL_CONTROL_ENABLE(value) (SILEX_RNG_CONTROL_CONTROL_ENABLE_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_ENABLE_Pos)) /* Assigment of value for ENABLE in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_LFSREN_Pos  _UINT32_(1)                                          /* (SILEX_RNG_CONTROL_CONTROL) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Position */
#define SILEX_RNG_CONTROL_CONTROL_LFSREN_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_LFSREN_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Mask */
#define SILEX_RNG_CONTROL_CONTROL_LFSREN(value) (SILEX_RNG_CONTROL_CONTROL_LFSREN_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_LFSREN_Pos)) /* Assigment of value for LFSREN in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_TESTEN_Pos  _UINT32_(2)                                          /* (SILEX_RNG_CONTROL_CONTROL) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Position */
#define SILEX_RNG_CONTROL_CONTROL_TESTEN_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_TESTEN_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Mask */
#define SILEX_RNG_CONTROL_CONTROL_TESTEN(value) (SILEX_RNG_CONTROL_CONTROL_TESTEN_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_TESTEN_Pos)) /* Assigment of value for TESTEN in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_CONDBYPASS_Pos _UINT32_(3)                                          /* (SILEX_RNG_CONTROL_CONTROL) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Position */
#define SILEX_RNG_CONTROL_CONTROL_CONDBYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_CONDBYPASS_Pos) /* (SILEX_RNG_CONTROL_CONTROL) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Mask */
#define SILEX_RNG_CONTROL_CONTROL_CONDBYPASS(value) (SILEX_RNG_CONTROL_CONTROL_CONDBYPASS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_CONDBYPASS_Pos)) /* Assigment of value for CONDBYPASS in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_INTENREP_Pos _UINT32_(4)                                          /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for Repetition Count Test failure. Position */
#define SILEX_RNG_CONTROL_CONTROL_INTENREP_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_INTENREP_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for Repetition Count Test failure. Mask */
#define SILEX_RNG_CONTROL_CONTROL_INTENREP(value) (SILEX_RNG_CONTROL_CONTROL_INTENREP_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_INTENREP_Pos)) /* Assigment of value for INTENREP in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_INTENPROP_Pos _UINT32_(5)                                          /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Position */
#define SILEX_RNG_CONTROL_CONTROL_INTENPROP_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_INTENPROP_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Mask */
#define SILEX_RNG_CONTROL_CONTROL_INTENPROP(value) (SILEX_RNG_CONTROL_CONTROL_INTENPROP_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_INTENPROP_Pos)) /* Assigment of value for INTENPROP in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_INTENFULL_Pos _UINT32_(7)                                          /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for FIFO full. Position */
#define SILEX_RNG_CONTROL_CONTROL_INTENFULL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_INTENFULL_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for FIFO full. Mask */
#define SILEX_RNG_CONTROL_CONTROL_INTENFULL(value) (SILEX_RNG_CONTROL_CONTROL_INTENFULL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_INTENFULL_Pos)) /* Assigment of value for INTENFULL in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_SOFTRST_Pos _UINT32_(8)                                          /* (SILEX_RNG_CONTROL_CONTROL) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Position */
#define SILEX_RNG_CONTROL_CONTROL_SOFTRST_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_SOFTRST_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Mask */
#define SILEX_RNG_CONTROL_CONTROL_SOFTRST(value) (SILEX_RNG_CONTROL_CONTROL_SOFTRST_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_SOFTRST_Pos)) /* Assigment of value for SOFTRST in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_INTENPRE_Pos _UINT32_(9)                                          /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for AIS31 preliminary noise alarm. Position */
#define SILEX_RNG_CONTROL_CONTROL_INTENPRE_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_INTENPRE_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for AIS31 preliminary noise alarm. Mask */
#define SILEX_RNG_CONTROL_CONTROL_INTENPRE(value) (SILEX_RNG_CONTROL_CONTROL_INTENPRE_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_INTENPRE_Pos)) /* Assigment of value for INTENPRE in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_INTENALM_Pos _UINT32_(10)                                         /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for AIS31 noise alarm. Position */
#define SILEX_RNG_CONTROL_CONTROL_INTENALM_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_INTENALM_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Interrupt enable for AIS31 noise alarm. Mask */
#define SILEX_RNG_CONTROL_CONTROL_INTENALM(value) (SILEX_RNG_CONTROL_CONTROL_INTENALM_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_INTENALM_Pos)) /* Assigment of value for INTENALM in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS_Pos _UINT32_(11)                                         /* (SILEX_RNG_CONTROL_CONTROL) Force oscillators to run when FIFO is full. Position */
#define SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Force oscillators to run when FIFO is full. Mask */
#define SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS(value) (SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_FORCEACTIVEROS_Pos)) /* Assigment of value for FORCEACTIVEROS in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS_Pos _UINT32_(12)                                         /* (SILEX_RNG_CONTROL_CONTROL) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Position */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Mask */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS(value) (SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_HEALTHTESTBYPASS_Pos)) /* Assigment of value for HEALTHTESTBYPASS in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS_Pos _UINT32_(13)                                         /* (SILEX_RNG_CONTROL_CONTROL) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Position */
#define SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Mask */
#define SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS(value) (SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_AIS31BYPASS_Pos)) /* Assigment of value for AIS31BYPASS in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL_Pos _UINT32_(14)                                         /* (SILEX_RNG_CONTROL_CONTROL) Select input to health test module: 0: Before conditioning, 1: After conditioning. Position */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Select input to health test module: 0: Before conditioning, 1: After conditioning. Mask */
#define SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL(value) (SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_HEALTHTESTSEL_Pos)) /* Assigment of value for HEALTHTESTSEL in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL_Pos _UINT32_(15)                                         /* (SILEX_RNG_CONTROL_CONTROL) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Position */
#define SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Mask */
#define SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL(value) (SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_AIS31TESTSEL_Pos)) /* Assigment of value for AIS31TESTSEL in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS_Pos _UINT32_(16)                                         /* (SILEX_RNG_CONTROL_CONTROL) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Position */
#define SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS_Msk (_UINT32_(0xF) << SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Mask */
#define SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS(value) (SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_NB128BITBLOCKS_Pos)) /* Assigment of value for NB128BITBLOCKS in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP_Pos _UINT32_(20)                                         /* (SILEX_RNG_CONTROL_CONTROL) Enable write of the samples in the FIFO during start-up. Position */
#define SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP_Pos) /* (SILEX_RNG_CONTROL_CONTROL) Enable write of the samples in the FIFO during start-up. Mask */
#define SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP(value) (SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CONTROL_FIFOWRITESTARTUP_Pos)) /* Assigment of value for FIFOWRITESTARTUP in the SILEX_RNG_CONTROL_CONTROL register */
#define SILEX_RNG_CONTROL_CONTROL_Msk         _UINT32_(0x001FFFBF)                                 /* (SILEX_RNG_CONTROL_CONTROL) Register Mask  */


/* -------- SILEX_RNG_CONTROL_FIFOLEVEL : (SILEX Offset: 0x1004) (R/W 32) FIFO level register. -------- */
#define SILEX_RNG_CONTROL_FIFOLEVEL_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_FIFOLEVEL) FIFO level register.  Reset Value */

#define SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_FIFOLEVEL) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Position */
#define SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL_Pos) /* (SILEX_RNG_CONTROL_FIFOLEVEL) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Mask */
#define SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL(value) (SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_FIFOLEVEL_FIFOLEVEL_Pos)) /* Assigment of value for FIFOLEVEL in the SILEX_RNG_CONTROL_FIFOLEVEL register */
#define SILEX_RNG_CONTROL_FIFOLEVEL_Msk       _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_FIFOLEVEL) Register Mask  */


/* -------- SILEX_RNG_CONTROL_FIFOTHRESHOLD : (SILEX Offset: 0x1008) (R/W 32) FIFO threshold register. -------- */
#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_FIFOTHRESHOLD) FIFO threshold register.  Reset Value */

#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_FIFOTHRESHOLD) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Position */
#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_FIFOTHRESHOLD) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Mask */
#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD(value) (SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos)) /* Assigment of value for FIFOTHRESHOLD in the SILEX_RNG_CONTROL_FIFOTHRESHOLD register */
#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_Msk   _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_FIFOTHRESHOLD) Register Mask  */


/* -------- SILEX_RNG_CONTROL_FIFODEPTH : (SILEX Offset: 0x100C) ( R/ 32) FIFO depth register. -------- */
#define SILEX_RNG_CONTROL_FIFODEPTH_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_FIFODEPTH) FIFO depth register.  Reset Value */

