Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/silex.h
/* -------- SILEX_RNG_CONTROL_AIS31CONF2 : (SILEX Offset: 0x1050) (R/W 32) AIS31 configuration register 2. -------- */
#define SILEX_RNG_CONTROL_AIS31CONF2_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_AIS31CONF2) AIS31 configuration register 2.  Reset Value */

#define SILEX_RNG_CONTROL_AIS31CONF2_HMIN_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_AIS31CONF2) Minimum allowed history value. Position */
#define SILEX_RNG_CONTROL_AIS31CONF2_HMIN_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF2_HMIN_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF2) Minimum allowed history value. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF2_HMIN(value) (SILEX_RNG_CONTROL_AIS31CONF2_HMIN_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF2_HMIN_Pos)) /* Assigment of value for HMIN in the SILEX_RNG_CONTROL_AIS31CONF2 register */
#define SILEX_RNG_CONTROL_AIS31CONF2_HMAX_Pos _UINT32_(16)                                         /* (SILEX_RNG_CONTROL_AIS31CONF2) Maximum allowed history value. Position */
#define SILEX_RNG_CONTROL_AIS31CONF2_HMAX_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF2_HMAX_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF2) Maximum allowed history value. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF2_HMAX(value) (SILEX_RNG_CONTROL_AIS31CONF2_HMAX_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF2_HMAX_Pos)) /* Assigment of value for HMAX in the SILEX_RNG_CONTROL_AIS31CONF2 register */
#define SILEX_RNG_CONTROL_AIS31CONF2_Msk      _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_AIS31CONF2) Register Mask  */


/* -------- SILEX_RNG_CONTROL_AIS31STATUS : (SILEX Offset: 0x1054) (R/W 32) AIS31 status register. -------- */
#define SILEX_RNG_CONTROL_AIS31STATUS_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_AIS31STATUS) AIS31 status register.  Reset Value */

#define SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Position */
#define SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos) /* (SILEX_RNG_CONTROL_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Mask */
#define SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS(value) (SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31STATUS_NUMPRELIMALARMS_Pos)) /* Assigment of value for NUMPRELIMALARMS in the SILEX_RNG_CONTROL_AIS31STATUS register */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos _UINT32_(16)                                         /* (SILEX_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Position */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos) /* (SILEX_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Mask */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG(value) (SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMRNG_Pos)) /* Assigment of value for PRELIMNOISEALARMRNG in the SILEX_RNG_CONTROL_AIS31STATUS register */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos _UINT32_(17)                                         /* (SILEX_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Position */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos) /* (SILEX_RNG_CONTROL_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Mask */
#define SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP(value) (SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31STATUS_PRELIMNOISEALARMREP_Pos)) /* Assigment of value for PRELIMNOISEALARMREP in the SILEX_RNG_CONTROL_AIS31STATUS register */
#define SILEX_RNG_CONTROL_AIS31STATUS_Msk     _UINT32_(0x0003FFFF)                                 /* (SILEX_RNG_CONTROL_AIS31STATUS) Register Mask  */


/* -------- SILEX_RNG_CONTROL_HWCONFIG : (SILEX Offset: 0x1058) ( R/ 32) Hardware configuration register. -------- */
#define SILEX_RNG_CONTROL_HWCONFIG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_HWCONFIG) Hardware configuration register.  Reset Value */

#define SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_NumRings value. Position */
#define SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Msk (_UINT32_(0xFF) << SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos) /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_NumRings value. Mask */
#define SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS(value) (SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_HWCONFIG_NUMBOFRINGS_Pos)) /* Assigment of value for NUMBOFRINGS in the SILEX_RNG_CONTROL_HWCONFIG register */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31_Pos  _UINT32_(8)                                          /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_AIS31 value. Position */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_HWCONFIG_AIS31_Pos) /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_AIS31 value. Mask */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31(value) (SILEX_RNG_CONTROL_HWCONFIG_AIS31_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_HWCONFIG_AIS31_Pos)) /* Assigment of value for AIS31 in the SILEX_RNG_CONTROL_HWCONFIG register */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31Full_Pos _UINT32_(9)                                          /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_AIS31Full value. Position */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31Full_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_HWCONFIG_AIS31Full_Pos) /* (SILEX_RNG_CONTROL_HWCONFIG) Generic g_AIS31Full value. Mask */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS31Full(value) (SILEX_RNG_CONTROL_HWCONFIG_AIS31Full_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_HWCONFIG_AIS31Full_Pos)) /* Assigment of value for AIS31Full in the SILEX_RNG_CONTROL_HWCONFIG register */
#define SILEX_RNG_CONTROL_HWCONFIG_Msk        _UINT32_(0x000003FF)                                 /* (SILEX_RNG_CONTROL_HWCONFIG) Register Mask  */

#define SILEX_RNG_CONTROL_HWCONFIG_AIS_Pos    _UINT32_(8)                                          /* (SILEX_RNG_CONTROL_HWCONFIG Position) Generic g_AIS3x value. */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS_Msk    (_UINT32_(0x1) << SILEX_RNG_CONTROL_HWCONFIG_AIS_Pos) /* (SILEX_RNG_CONTROL_HWCONFIG Mask) AIS */
#define SILEX_RNG_CONTROL_HWCONFIG_AIS(value) (SILEX_RNG_CONTROL_HWCONFIG_AIS_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_HWCONFIG_AIS_Pos)) 

/* -------- SILEX_PK_POINTERS : (SILEX Offset: 0x2000) (R/W 32) Pointers register. -------- */
#define SILEX_PK_POINTERS_RESETVALUE          _UINT32_(0x00)                                       /*  (SILEX_PK_POINTERS) Pointers register.  Reset Value */

#define SILEX_PK_POINTERS_OPPTRA_Pos          _UINT32_(0)                                          /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Position */
#define SILEX_PK_POINTERS_OPPTRA_Msk          (_UINT32_(0xF) << SILEX_PK_POINTERS_OPPTRA_Pos)      /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Mask */
#define SILEX_PK_POINTERS_OPPTRA(value)       (SILEX_PK_POINTERS_OPPTRA_Msk & (_UINT32_(value) << SILEX_PK_POINTERS_OPPTRA_Pos)) /* Assigment of value for OPPTRA in the SILEX_PK_POINTERS register */
#define SILEX_PK_POINTERS_OPPTRB_Pos          _UINT32_(8)                                          /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Position */
#define SILEX_PK_POINTERS_OPPTRB_Msk          (_UINT32_(0xF) << SILEX_PK_POINTERS_OPPTRB_Pos)      /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Mask */
#define SILEX_PK_POINTERS_OPPTRB(value)       (SILEX_PK_POINTERS_OPPTRB_Msk & (_UINT32_(value) << SILEX_PK_POINTERS_OPPTRB_Pos)) /* Assigment of value for OPPTRB in the SILEX_PK_POINTERS register */
#define SILEX_PK_POINTERS_OPPTRC_Pos          _UINT32_(16)                                         /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Position */
#define SILEX_PK_POINTERS_OPPTRC_Msk          (_UINT32_(0xF) << SILEX_PK_POINTERS_OPPTRC_Pos)      /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Mask */
#define SILEX_PK_POINTERS_OPPTRC(value)       (SILEX_PK_POINTERS_OPPTRC_Msk & (_UINT32_(value) << SILEX_PK_POINTERS_OPPTRC_Pos)) /* Assigment of value for OPPTRC in the SILEX_PK_POINTERS register */
#define SILEX_PK_POINTERS_OPPTRN_Pos          _UINT32_(24)                                         /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Position */
#define SILEX_PK_POINTERS_OPPTRN_Msk          (_UINT32_(0xF) << SILEX_PK_POINTERS_OPPTRN_Pos)      /* (SILEX_PK_POINTERS) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Mask */
#define SILEX_PK_POINTERS_OPPTRN(value)       (SILEX_PK_POINTERS_OPPTRN_Msk & (_UINT32_(value) << SILEX_PK_POINTERS_OPPTRN_Pos)) /* Assigment of value for OPPTRN in the SILEX_PK_POINTERS register */
#define SILEX_PK_POINTERS_Msk                 _UINT32_(0x0F0F0F0F)                                 /* (SILEX_PK_POINTERS) Register Mask  */


/* -------- SILEX_PK_COMMAND : (SILEX Offset: 0x2004) (R/W 32) Command register. -------- */
#define SILEX_PK_COMMAND_RESETVALUE           _UINT32_(0x0F)                                       /*  (SILEX_PK_COMMAND) Command register.  Reset Value */

#define SILEX_PK_COMMAND_OPEADDR_Pos          _UINT32_(0)                                          /* (SILEX_PK_COMMAND) This field defines the operation to be performed. See documentation for more details. Position */
#define SILEX_PK_COMMAND_OPEADDR_Msk          (_UINT32_(0x7F) << SILEX_PK_COMMAND_OPEADDR_Pos)     /* (SILEX_PK_COMMAND) This field defines the operation to be performed. See documentation for more details. Mask */
#define SILEX_PK_COMMAND_OPEADDR(value)       (SILEX_PK_COMMAND_OPEADDR_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_OPEADDR_Pos)) /* Assigment of value for OPEADDR in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_FIELDF_Pos           _UINT32_(7)                                          /* (SILEX_PK_COMMAND) '0': Field is GF(p) '1': Field is GF(2**m) Position */
#define SILEX_PK_COMMAND_FIELDF_Msk           (_UINT32_(0x1) << SILEX_PK_COMMAND_FIELDF_Pos)       /* (SILEX_PK_COMMAND) '0': Field is GF(p) '1': Field is GF(2**m) Mask */
#define SILEX_PK_COMMAND_FIELDF(value)        (SILEX_PK_COMMAND_FIELDF_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_FIELDF_Pos)) /* Assigment of value for FIELDF in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_OPBYTESM1_Pos        _UINT32_(8)                                          /* (SILEX_PK_COMMAND) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Position */
#define SILEX_PK_COMMAND_OPBYTESM1_Msk        (_UINT32_(0x3FF) << SILEX_PK_COMMAND_OPBYTESM1_Pos)  /* (SILEX_PK_COMMAND) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Mask */
#define SILEX_PK_COMMAND_OPBYTESM1(value)     (SILEX_PK_COMMAND_OPBYTESM1_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_OPBYTESM1_Pos)) /* Assigment of value for OPBYTESM1 in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_RANDMOD_Pos          _UINT32_(19)                                         /* (SILEX_PK_COMMAND) Enable randomization of modulus (counter-measure). Position */
#define SILEX_PK_COMMAND_RANDMOD_Msk          (_UINT32_(0x1) << SILEX_PK_COMMAND_RANDMOD_Pos)      /* (SILEX_PK_COMMAND) Enable randomization of modulus (counter-measure). Mask */
#define SILEX_PK_COMMAND_RANDMOD(value)       (SILEX_PK_COMMAND_RANDMOD_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_RANDMOD_Pos)) /* Assigment of value for RANDMOD in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_SELCURVE_Pos         _UINT32_(20)                                         /* (SILEX_PK_COMMAND) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Position */
#define SILEX_PK_COMMAND_SELCURVE_Msk         (_UINT32_(0x7) << SILEX_PK_COMMAND_SELCURVE_Pos)     /* (SILEX_PK_COMMAND) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Mask */
#define SILEX_PK_COMMAND_SELCURVE(value)      (SILEX_PK_COMMAND_SELCURVE_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_SELCURVE_Pos)) /* Assigment of value for SELCURVE in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_RANDKE_Pos           _UINT32_(24)                                         /* (SILEX_PK_COMMAND) Enable randomization of exponent/scalar (counter-measure). Position */
#define SILEX_PK_COMMAND_RANDKE_Msk           (_UINT32_(0x1) << SILEX_PK_COMMAND_RANDKE_Pos)       /* (SILEX_PK_COMMAND) Enable randomization of exponent/scalar (counter-measure). Mask */
#define SILEX_PK_COMMAND_RANDKE(value)        (SILEX_PK_COMMAND_RANDKE_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_RANDKE_Pos)) /* Assigment of value for RANDKE in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_RANDPROJ_Pos         _UINT32_(25)                                         /* (SILEX_PK_COMMAND) Enable randomization of projective coordinates (counter-measure). Position */
#define SILEX_PK_COMMAND_RANDPROJ_Msk         (_UINT32_(0x1) << SILEX_PK_COMMAND_RANDPROJ_Pos)     /* (SILEX_PK_COMMAND) Enable randomization of projective coordinates (counter-measure). Mask */
#define SILEX_PK_COMMAND_RANDPROJ(value)      (SILEX_PK_COMMAND_RANDPROJ_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_RANDPROJ_Pos)) /* Assigment of value for RANDPROJ in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_EDWARDS_Pos          _UINT32_(26)                                         /* (SILEX_PK_COMMAND) Enable Edwards curve (see operation description). Position */
#define SILEX_PK_COMMAND_EDWARDS_Msk          (_UINT32_(0x1) << SILEX_PK_COMMAND_EDWARDS_Pos)      /* (SILEX_PK_COMMAND) Enable Edwards curve (see operation description). Mask */
#define SILEX_PK_COMMAND_EDWARDS(value)       (SILEX_PK_COMMAND_EDWARDS_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_EDWARDS_Pos)) /* Assigment of value for EDWARDS in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_SWAPBYTES_Pos        _UINT32_(28)                                         /* (SILEX_PK_COMMAND) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Position */
#define SILEX_PK_COMMAND_SWAPBYTES_Msk        (_UINT32_(0x1) << SILEX_PK_COMMAND_SWAPBYTES_Pos)    /* (SILEX_PK_COMMAND) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Mask */
#define SILEX_PK_COMMAND_SWAPBYTES(value)     (SILEX_PK_COMMAND_SWAPBYTES_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_SWAPBYTES_Pos)) /* Assigment of value for SWAPBYTES in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_FLAGA_Pos            _UINT32_(29)                                         /* (SILEX_PK_COMMAND) See operation description. Position */
#define SILEX_PK_COMMAND_FLAGA_Msk            (_UINT32_(0x1) << SILEX_PK_COMMAND_FLAGA_Pos)        /* (SILEX_PK_COMMAND) See operation description. Mask */
#define SILEX_PK_COMMAND_FLAGA(value)         (SILEX_PK_COMMAND_FLAGA_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_FLAGA_Pos)) /* Assigment of value for FLAGA in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_FLAGB_Pos            _UINT32_(30)                                         /* (SILEX_PK_COMMAND) See operation description. Position */
#define SILEX_PK_COMMAND_FLAGB_Msk            (_UINT32_(0x1) << SILEX_PK_COMMAND_FLAGB_Pos)        /* (SILEX_PK_COMMAND) See operation description. Mask */
#define SILEX_PK_COMMAND_FLAGB(value)         (SILEX_PK_COMMAND_FLAGB_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_FLAGB_Pos)) /* Assigment of value for FLAGB in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_CALCR2_Pos           _UINT32_(31)                                         /* (SILEX_PK_COMMAND) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Position */
#define SILEX_PK_COMMAND_CALCR2_Msk           (_UINT32_(0x1) << SILEX_PK_COMMAND_CALCR2_Pos)       /* (SILEX_PK_COMMAND) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Mask */
#define SILEX_PK_COMMAND_CALCR2(value)        (SILEX_PK_COMMAND_CALCR2_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_CALCR2_Pos)) /* Assigment of value for CALCR2 in the SILEX_PK_COMMAND register */
#define SILEX_PK_COMMAND_Msk                  _UINT32_(0xF77BFFFF)                                 /* (SILEX_PK_COMMAND) Register Mask  */

#define SILEX_PK_COMMAND_CALCR_Pos            _UINT32_(31)                                         /* (SILEX_PK_COMMAND Position) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to 'x' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. 'x': don't recalculate R**2 mod N 'x': re-calculate R**2 mod N */
#define SILEX_PK_COMMAND_CALCR_Msk            (_UINT32_(0x1) << SILEX_PK_COMMAND_CALCR_Pos)        /* (SILEX_PK_COMMAND Mask) CALCR */
#define SILEX_PK_COMMAND_CALCR(value)         (SILEX_PK_COMMAND_CALCR_Msk & (_UINT32_(value) << SILEX_PK_COMMAND_CALCR_Pos)) 

/* -------- SILEX_PK_CONTROL : (SILEX Offset: 0x2008) ( /W 32) Command register. -------- */
#define SILEX_PK_CONTROL_RESETVALUE           _UINT32_(0x00)                                       /*  (SILEX_PK_CONTROL) Command register.  Reset Value */

